#include "./Headers/Everything.h"


void menu1()
   {
   	printf("                     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \n    ");
  	printf("                 |                      这里是广东工业大学学生信息管理系统                   |    \n");
  	printf("                     |    请选择你的身份进行登录：                                               |\n");
   	printf("                     |                                                                           |\n");
  	printf("                     |     1.学生                                 2.老师                         |\n");
   	printf("                     |                                                                           |\n");
  	printf("                     |    你选择的身份是：                                                       |\n");
   	printf("                     |                                                                           |\n");
  	printf("                     |                                                                           |\n");
  	printf("                     |                                                                           |\n");
   	printf("                     |                                                                           |\n");
  	printf("                     |                                                                           |\n");                                                                         
 	printf("                     |                                                                           |\n");
 	printf("                     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \n    ");
}

 void menu2()
 {
 printf("\n");
 printf("                     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \n    ");
 printf("                 |                  这里是广东工业大学学生信息管理系统                       |\n");
 printf("                     | 请输入你的账户信息：                                                      |\n");
 printf("                     |                                                                           |\n");
 printf("                     |  账户：                                                                   |\n");
 printf("                     |                                                                           |\n");
 printf("                     |  密码：                                                                   |\n");
 printf("                     |                                                                           |\n");
 printf("                     |                                                                           |\n");
 printf("                     |                                                                           |\n");
 printf("                     |                                                                           |\n");
 printf("                     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \n    ");
 }

 void menu3()
 {
 	printf("                    -----------------------------------------------------------------------------\n");
	printf("                    |   欢迎登陆广东工业大学学生信息管理系统                                    |\n");
 	printf("                    |                                                                           |\n ");
 	printf("                   |      请选择操作:                                                          |\n");
	printf("                    |                                                                           |\n");
	printf("                    |     1.浏览学生信息.                            ");
 	printf("2.新建学生信息.            |\n");
 	printf("                    |     3.查询学生信息.                            ");
 	printf("4.修改学生信息.            |\n");
	printf("                    |     5.删除学生信息.   ");
 	printf("                         0.退出并保存信息.          |\n");
     printf("                    |                                                                           |\n");
 	printf("                    |  你的选择是：                                                             | \n");
 	printf("                    -----------------------------------------------------------------------------\n");

 }

 void menu4()
 {
 	printf("                    -----------------------------------------------------------------------------\n");
 	printf("                    |   欢迎登陆广东工业大学学生信息管理系统                                    |\n");
 	printf("                    |                                                                           |\n ");
 	printf("                   |      请选择操作:                                                          |\n");
 	printf("                    |     （你只能查询信息不能进行更改）                                        |\n");
 	printf("                    |                                                                           |\n");
 	printf("                    |     1.浏览学生信息.                            ");
 	printf("2.查询学生信息.            |\n");
	printf("                    |                         ");
 	printf("0.退出并保存信息.                                 |\n");
     printf("                    |                                                                           |\n");
  	printf("                    |  你的选择是：                                                             | \n");
	printf("                    |                                                                           |\n ");
	printf("                   |                                                                           | \n ");
  	printf("                   -----------------------------------------------------------------------------\n");
 }

 void menu5(long long account)
 {
 printf("\n");
 printf("                     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \n    ");
 printf("                 |                  这里是广东工业大学学生信息管理系统                       |\n");
 printf("                     | 请输入你的账户信息：                                                      |\n");
 printf("                     |                                                                           |\n");
 printf("                     |  账户：%12lld                                                       |\n",account);
 printf("                     |                                                                           |\n");
 printf("                     |  密码：                                                                   |\n");
 printf("                     |                                                                           |\n");
 printf("                     |                                                                           |\n");
 printf("                     |                                                                           |\n");
 printf("                     |                                                                           |\n");
 printf("                     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \n    ");
 }

  void menu6()
 {
 	printf("                    -----------------------------------------------------------------------------\n");
 	printf("                    |   欢迎登陆广东工业大学学生信息管理系统                                    |\n");
 	printf("                    |    查看学生系统：                                                         |\n ");
 	printf("                   |                                                                           |\n");
 	printf("                    |     学生信息为空，请返回主菜单新建信息!!!                                 |\n");
 	printf("                    |                                                                           |\n");
 	printf("                    |                                                                           |\n ");
	printf("                   |                                                                           |\n  ");
    printf("                  |                                                                           |\n");
  	printf("                    |                                                                           | \n");
	printf("                    |                                                                           |\n ");
	printf("                   |                                                                           | \n ");
  	printf("                   -----------------------------------------------------------------------------\n");
 }
 void menu7(long long a)
 {
 	printf("                    -----------------------------------------------------------------------------\n");
 	printf("                    |   欢迎登陆广东工业大学学生信息管理系统                                    |\n");
 	printf("                    |    新建学生信息：                                                         |\n ");
 	printf("                   |                                                                           |\n");
 	printf("                    |       请输入学生姓名；%s                                                  |\n");
 	printf("                    |       请输入学生学号：%d                                            |\n",a);
 	printf("                    |       请输入学生性别：%s                                                  |\n ");
	printf("                   |       请输入学生绩点；%1.4f                                              |\n  ");
    printf("                  |                                                                           |\n");
  	printf("                    |                                                                           | \n");
	printf("                    |                                                                           |\n ");
	printf("                   |                                                                           | \n ");
  	printf("                   -----------------------------------------------------------------------------\n");
 }

  void menu9()
 {
 	printf("                    -----------------------------------------------------------------------------\n");
 	printf("                    |   欢迎登陆广东工业大学学生信息管理系统                                    |\n");
 	printf("                    |    新建学生信息：                                                         |\n ");
 	printf("                   |                                                                           |\n");
 	printf("                    |       请输入学生姓名；                                                    |\n");
 	printf("                    |       请输入学生学号：                                                    |\n");
 	printf("                    |       请输入学生性别：                                                    |\n ");
	printf("                   |       请输入学生绩点；                                                    |\n  ");
    printf("                  |                                                                           |\n");
  	printf("                    |                                                                           | \n");
	printf("                    |                                                                           |\n ");
	printf("                   |                                                                           | \n ");
  	printf("                   -----------------------------------------------------------------------------\n");
 }
  void menu10(char name[20],long long num,char sex[3],double score)
 {
 	printf("                    -----------------------------------------------------------------------------\n");
 	printf("                    |   欢迎登陆广东工业大学学生信息管理系统                                    |\n");
 	printf("                    |    新建学生信息：                                                         |\n ");
 	printf("                   |                                                                           |\n");
 	printf("                    |       请输入学生姓名；%9s                                           |\n",name);
 	printf("                    |       请输入学生学号：                                                    |\n");
 	printf("                    |       请输入学生性别：                                                    |\n ");
	printf("                   |       请输入学生绩点；                                                    |\n  ");
    printf("                  |                                                                           |\n");
  	printf("                    |                                                                           | \n");
	printf("                    |                                                                           |\n ");
	printf("                   |                                                                           | \n ");
  	printf("                   -----------------------------------------------------------------------------\n");
 }
  void menu11(char name[20],long long num,char sex[3],double score)
 {
 	printf("                    -----------------------------------------------------------------------------\n");
 	printf("                    |   欢迎登陆广东工业大学学生信息管理系统                                    |\n");
 	printf("                    |    新建学生信息：                                                         |\n ");
 	printf("                   |                                                                           |\n");
 	printf("                    |       请输入学生姓名；%9s                                           |\n",name);
 	printf("                    |       请输入学生学号：%13lld                                       |\n",num);
 	printf("                    |       请输入学生性别：                                                    |\n ");
	printf("                   |       请输入学生绩点；                                                    |\n  ");
    printf("                  |                                                                           |\n");
  	printf("                    |                                                                           | \n");
	printf("                    |                                                                           |\n ");
	printf("                   |                                                                           | \n ");
  	printf("                   -----------------------------------------------------------------------------\n");
 }

void menu12(char name[20],long long num,char sex[3],double score)
{
	printf("                    -----------------------------------------------------------------------------\n");
 	printf("                    |   欢迎登陆广东工业大学学生信息管理系统                                    |\n");
 	printf("                    |    新建学生信息：                                                         |\n ");
 	printf("                   |                                                                           |\n");
 	printf("                    |       请输入学生姓名；%9s                                           |\n",name);
 	printf("                    |       请输入学生学号：%13lld                                       |\n",num);
 	printf("                    |       请输入学生性别：%5s                                               |\n ",sex);
	printf("                   |       请输入学生绩点；                                                    |\n  ");
    printf("                  |                                                                           |\n");
  	printf("                    |                                                                           | \n");
	printf("                    |                                                                           |\n ");
	printf("                   |                                                                           | \n ");
  	printf("                   -----------------------------------------------------------------------------\n");
}

void menu13(char name[20],long long num,char sex[3],double score)
{
	printf("                    -----------------------------------------------------------------------------\n");
 	printf("                    |   欢迎登陆广东工业大学学生信息管理系统                                    |\n");
 	printf("                    |    新建学生信息：                                                         |\n ");
 	printf("                   |                                                                           |\n");
 	printf("                    |       请输入学生姓名；%9s                                           |\n",name);
 	printf("                    |       请输入学生学号：%13lld                                       |\n",num);
 	printf("                    |       请输入学生性别：%5s                                               |\n ",sex);
	printf("                   |       请输入学生绩点；%7.2lf                                             |\n  ",score);
    printf("                  |                                                                           |\n");
  	printf("                    |                                                                           | \n");
	printf("                    |                                                                           |\n ");
	printf("                   |                                                                           | \n ");
  	printf("                   -----------------------------------------------------------------------------\n");
}
  void menu14()
 {
	printf("\n");
 	printf("                    -----------------------------------------------------------------------------\n");
 	printf("                    |                   欢迎登陆广东工业大学学生信息管理系统                    |\n");
 	printf("                    |                                                                           |\n ");
 	printf("                   |                                                                           |\n");
 	printf("                    |                                                                           |\n");
 	printf("                    |                                                                           |\n");
 	printf("                    |                                                                           |\n ");
	printf("                   |                                                                           |\n  ");
    printf("                  |                                                                           |\n");
  	printf("                    |                                                                           | \n");
	printf("                    |                                                                           |\n ");
	printf("                   |                                                             输入回车以继续| \n ");
  	printf("                   -----------------------------------------------------------------------------\n");
 }

 void menu15()
 {
 printf("                     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \n    ");
 printf("                 |                  这里是广东工业大学学生信息管理系统                       |\n");
 printf("                     |           该账户不存在！                                                  |\n");
 printf("                     |           请选择操作继续                                                  |\n");
 printf("                     |           输入“ESC”,退出                                                |\n");
 printf("                     |           输入“回车”重新输入                                            |\n");
 printf("                     |                                                                           |\n");
 printf("                     |                                                                           |\n");
 printf("                     |                                                                           |\n");
 printf("                     |                                                                           |\n");
 printf("                     |                                                                           |\n");
 printf("                     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \n    ");
 }